In [1]:
import pandas as pd
import numpy as np

In [2]:
sozluk1  = {"İsim" : ["Behçet", "Emre", "Atıl", "Gizem"], "Spor" : ["Basketbol", "Tenis", "Voleybol", "Futbol"],
"Kalori" : [100,200,300,400]
}
sozluk2 = {"İsim" : ["Naz", "Nur", "Murat", "Şevval"], "Spor" : ["Basketbol", "Beyzbol", "Voleybol", "Tenis"],
"Kalori" : [300,600,800,900]
}
sozluk3 = {"İsim" : ["Kıvanç", "yavuz", "Mert", "Mete"], "Spor" : ["Futbol", "Yüzme", "Basketbol", "Futbol"],
"Kalori" : [150,910,400,130]
}

In [3]:
dataFrame1 = pd.DataFrame(sozluk1)
dataFrame2 = pd.DataFrame(sozluk2)
dataFrame3 = pd.DataFrame(sozluk3)

In [4]:
dataFrame1

     İsim       Spor  Kalori
0  Behçet  Basketbol     100
1    Emre      Tenis     200
2    Atıl   Voleybol     300
3   Gizem     Futbol     400

## concat

In [5]:
pd.concat([dataFrame1,dataFrame2,dataFrame3]) # ayrı olan dataFrame'leri alt alta koyar ama index'leri değiştirmez

     İsim       Spor  Kalori
0  Behçet  Basketbol     100
1    Emre      Tenis     200
2    Atıl   Voleybol     300
3   Gizem     Futbol     400
0     Naz  Basketbol     300
1     Nur    Beyzbol     600
2   Murat   Voleybol     800
3  Şevval      Tenis     900
0  Kıvanç     Futbol     150
1   yavuz      Yüzme     910
2    Mert  Basketbol     400
3    Mete     Futbol     130

In [22]:
pd.concat([dataFrame1,dataFrame2,dataFrame3], ignore_index=True) # indexleri sıralar

      İsim       Spor  Kalori
0   Behçet  Basketbol     100
1     Emre      Tenis     200
2     Atıl   Voleybol     300
3    Gizem     Futbol     400
4      Naz  Basketbol     300
5      Nur    Beyzbol     600
6    Murat   Voleybol     800
7   Şevval      Tenis     900
8   Kıvanç     Futbol     150
9    yavuz      Yüzme     910
10    Mert  Basketbol     400
11    Mete     Futbol     130

## merge

In [6]:
sporSozluk = {"İsim" : ["Behçet", "Emre", "Atıl", "Gizem"], "Spor" : ["Basketbol", "Tenis", "Voleybol", "Futbol"],
}
sporDataFrame = pd.DataFrame(sporSozluk)

In [7]:
sporDataFrame

     İsim       Spor
0  Behçet  Basketbol
1    Emre      Tenis
2    Atıl   Voleybol
3   Gizem     Futbol

In [8]:
kaloriSozluk = {"İsim" : ["Behçet", "Emre", "Atıl", "Gizem"], "Kalori" : [100,200,300,400]}
kaloriDataFrame = pd.DataFrame(kaloriSozluk)

In [9]:
kaloriDataFrame

     İsim  Kalori
0  Behçet     100
1    Emre     200
2    Atıl     300
3   Gizem     400

In [10]:
pd.merge(sporDataFrame,kaloriDataFrame, on="İsim") #ayrı olan 2 DF'yi ortak bulunan bir kolondan birleştirir

     İsim       Spor  Kalori
0  Behçet  Basketbol     100
1    Emre      Tenis     200
2    Atıl   Voleybol     300
3   Gizem     Futbol     400

In [11]:
maasSozluk = {"Departman" : ["Yazılım","Pazarlama","Satış","Yazılım"],"İsim" : ["Behçet", "Emre", "Atıl", "Gizem"],
"Maaş" : [700,500,300,100]
}
maasDataframe = pd.DataFrame(maasSozluk)

In [12]:
maasDataframe

   Departman    İsim  Maaş
0    Yazılım  Behçet   700
1  Pazarlama    Emre   500
2      Satış    Atıl   300
3    Yazılım   Gizem   100

In [13]:
maasDataframe["Departman"].unique() # departman kolonunda kaç farklı veri varsa onları dizi halinde gösterir

array(['Yazılım', 'Pazarlama', 'Satış'], dtype=object)

In [14]:
maasDataframe["Departman"].nunique() #departman kolonunda kaç farklı veri varsa onların sayısını getirir

3

In [15]:
maasDataframe["Departman"].value_counts() #departman kolonundaki verilerden kaçar tane olduğunu getirir

Yazılım      2
Pazarlama    1
Satış        1
Name: Departman, dtype: int64

In [16]:
def bruttenNete(maas):
    return maas * 0.66

In [17]:
maasDataframe["Maaş"].apply(bruttenNete) #apply -> dataFrame'lere kolayca fonksiyon uygulayabilmemizi sağlar

0    462.0
1    330.0
2    198.0
3     66.0
Name: Maaş, dtype: float64

In [18]:
maasDataframe.isnull() # null değer olup olmadığını gösterir

   Departman   İsim   Maaş
0      False  False  False
1      False  False  False
2      False  False  False
3      False  False  False

In [19]:
yeniVeri = {"Aile Adı" : ["South Park","South Park","Simpson","Simpson","Simpson"],
"İsim" : ["Cartman","Keny","Homer","Bart","Bart"],
"Yaş" : [20,30,40,50,10]
}
yeniDF = pd.DataFrame(yeniVeri)

In [20]:
yeniDF

     Aile Adı     İsim  Yaş
0  South Park  Cartman   20
1  South Park     Keny   30
2     Simpson    Homer   40
3     Simpson     Bart   50
4     Simpson     Bart   10

In [21]:
yeniDF.pivot_table(values="Yaş", index=["Aile Adı", "İsim"],aggfunc=np.sum) 
#tablodaki veriler values, index'lerim index, aggfunc -> fonksiyon kullanımı gerektirecek durumlarda hangi fonk. kullansın
#bart'tan 2 tane olduğu için bart verisini alırken yaş verilerini toplar ve tek index'te birleştirir

                    Yaş
Aile Adı   İsim
Simpson    Bart      60
           Homer     40
South Park Cartman   20
           Keny      30